{
  "meta": {
    "title": "Research Team Member - Modeller - Jobs"
  },
  "job": {
    "category": "Research",
    "title": "Research Team Member - Modeller",
    "slug": "modeller-swarm-research-team",
    "description": "<p>The Swarm Foundation Research Team is looking for a Modeller researcher. For this role you'll be contributing to the ongoing effort of specifying Swarm's protocols and strategies.</p>",
    "content": "<p>Swarm is a system of peer-to-peer networked nodes for a decentralised storage and communication service.</p><p>Swarm could shape the future towards a self-sovereign global society and permissionless open markets. On Swarm, applications run autonomously yet securely in a planetary-scale deployment and execution environment.</p><p>The Swarm Research Team is tasked with rigorously spelling out and analysing Swarm’s underlying theory as well as the current implementation. We create theories, write code, run experiments and make concrete suggestions to Swarm’s engineering teams for further improvements. Our work is consumed by various Swarm teams, as well as the wider (research) community.</p><p>We are looking for a profile that can help increase the understanding of Swarm and improve communication of what Swarm is by clearly articulating all of our assumptions and choices and making models to communicate, refine and challenge these.</p><p>Please note: this is a pipeline builder announcement, preparing for the upcoming demand. Feel free to submit your application so we can get back to you as soon as the role is open.</p><h2>Your role</h2><ul><li>Contributing to the ongoing work effort of specifying Swarm’s protocols and strategies</li><li>Leading the effort to build a TLA+ model of all Swarm’s protocols, basing yourself on source-codeand conversations with various stakeholders</li><li>Collaborating with the engineering and research teams to interpret the TLA+ model and draw theconclusions</li><li>Communicate and validate any iteration of Swarm by means of modelling</li><li>Assessing Swarm’s assumed game-theoretic equilibria, using modelling frameworks such as CadCad</li></ul><h2>Your profile</h2><ul><li>You are a self-starter</li><li>You like to help others</li><li>You have a technical background</li><li>You are curious</li><li>You like to work remotely</li><li>You are analytically minded</li><li>You can express yourself fluently in English, both verbally and in writing</li></li></ul><h2>We appreciate</h2><ul><li>Experience with either or both TLA+ and CadCad or willing to learn</li><li>Understanding of Golang, Kubernetes, Grafana, Jaeger, OpenTracing and Typescript or willing to learn</li><li>A good grasp of distributed systems</li></ul><h2>Swarm offers/Team perks:</h2><ul><li>An open, flat and transparent work environment</li><li>100% remote friendly</li><li>Flexible working hours</li><li>We care about our swarm: Incentives through BZZ, Swarm’s token</li></ul><br /><p>Should you be interested in the position, please send your CV to <a href=\"mailto:talent@ethswarm.org\" target=\"_blank\">talent@ethswarm.org</a>.</p>"
  }
}
