{
  "meta": {
    "title": "QA Engineer (Go) - Jobs"
  },
  "job": {
    "category": "Bee",
    "title": "QA Engineer (Go)",
    "slug": "qa-engineer-go",
    "description": "<p>Bee is a Swarm client implemented in Go. It’s the basic building block for the Swarm Network. Bee provides low level constructs for file storage, feeds, key-value stores and untraceable communication, through solid, well-tested code delivered in an agile manner.</p>",
    "content": "<p>Swarm is a system of peer-to-peer networked nodes for a decentralised storage and communication service.</p><p>Swarm could shape the future towards a self-sovereign global society and permissionless open markets. On Swarm, applications run autonomously yet securely in a planetary-scale deployment and execution environment.</p><p>Bee is a Swarm client implemented in Go. It’s the basic building block for the Swarm Network. Bee provides low level constructs for file storage, feeds, key-value stores and untraceable communication, through solid, well-tested code delivered in an agile manner.</p><p>Key technologies are Go, libp2p, protobuf, leveldb, and go-ethereum, as well as various cryptographic libraries.</p><h2>Your role</h2><ul><li>Writing and executing end-to-end test scenarios in order to assure performance and reliability</li><li>Submit detailed bug reports and issues to our dev team</li><li>Take an active part in shaping the way our products are built by analysing how functionality, user experience and performance could be improved</li></ul><h2>Your profile</h2><ul><li>You have at least 3 years' experience delivering working, tested software</li><li>You are familiar with Golang</li><li>You are familiar with the blockchain ecosystem</li><li>You are familiar with Grafana, Jaeger and OpenTracing</li><li>You have experience of working remotely (with all of its complexities)</li><li>You are available around the CET timezone</li><li>You manage your own time effectively and respect time constraints</li><li>You like to take the initiative</li><li>You can express yourself fluently in English, both verbally and in writing</li></ul><h2>We appreciate</h2><ul><li>A good grasp of distributed systems</li><li>General acquaintance with cryptographic concepts</li><li>Experience with the Javascript ecosystem</li><li>Hands-on experience implementing test automation</li></ul><h2>Swarm offers</h2><ul><li>Competitive compensation as an independent contractor</li><li>An open, flat and transparent work environment</li><li>The opportunity to be part of a diverse and ambitious remote team</li><li>Flexible working hours and remote work</li></ul><p>To apply, please send a cover letter along with your CV and GitHub profile link to <a href=\"mailto:talent@ethswarm.org\" target=\"_blank\">talent@ethswarm.org</a>.</p>"
  }
}
