{
  "meta": {
    "title": "Security Researcher - Jobs"
  },
  "job": {
    "category": "Research",
    "title": "Security Researcher",
    "slug": "security-researcher",
    "description": "<p>The Swarm Foundation Research Team is looking for a security researcher. Your job is to keep the Swarm network safe and reliable for our users by discovering attacks and vulnerabilities before other people find out.</p>",
    "content": " <p>Swarm is a system of peer-to-peer networked nodes for a decentralised storage and communication service. </p><p>Swarm could shape the future towards a self-sovereign global society and permissionless open markets. On Swarm, applications run autonomously yet securely in a planetary-scale deployment and execution environment.</p><p>The Swarm Research Team is tasked with rigorously spelling out and analysing Swarm’s underlying theory as well as the current implementation. We create theories, write code, run experiments and make concrete suggestions to Swarm’s engineering teams for further improvements. Our work is consumed by various Swarm teams, as well as the wider (research) community.</p><h2>Your role</h2> <p>Your job is to keep the Swarm network safe and reliable for our users by discovering attacks and vulnerabilities before other people find out. As such, </p><ul> <li>You are responsible to continuously examine the source code of the <a href=\"https://github.com/ethersphere/bee\" target=\"_blank\">bee client</a> and it’s dependencies on potential security holes. The means of examination can be, but are not limited to: </li><ul> <li>Source-code audit </li><li>Penetration testing </li><li>Analysis of vulnerabilities and their solutions of comparable projects </li><li>Creation of malfunctioning/adversarial nodes </li></ul> <li>You work together with the main Swarm architects to recommend solutions to the team</li><li>You collaborate with well-renowed external auditing firms and are their first point of contact</li><li>You work together with the Swarm devops team in setting up monitoring for the Swarm network which would detect suspicious activity</li></ul> <h2>Your profile</h2> <ul> <li>You like to work remotely</li><li>You have attention to detail</li><li>You are not shy to break things</li><li>You have an understanding of decentralised protocols and their vulnerabilities for attacks</li><li>ou can express yourself fluently in English, at least in writing</li></ul> <h2>We appreciate</h2> <ul> <li>At least knowledge of one programming language in which you are able to conduct attacks on the Swarm network. Golang is preferred</li></ul> <h2>Swarm offers/Team perks:</h2> <ul> <li>An open, flat and transparent work environment</li><li>100% remote friendly</li><li>Flexible working hours</li><li>We care about our swarm: Incentives through BZZ, Swarm’s token</li></ul> <p> Should you be interested in the position, please send your CV to <a href=\"mailto:talent@ethswarm.org\" target=\"_blank\">talent@ethswarm.org</a>.</p>"
  }
}
