{
  "meta": {
    "title": "Senior Javascript Developer - Jobs"
  },
  "job": {
    "category": "JS / Bee-JS",
    "title": "Senior Javascript Developer",
    "slug": "senior-javascript-developer",
    "description": "<p>The Swarm Foundation Javascript Team is looking for a senior Javascript developer. For this role, you should have experience designing and shaping APIs. Ideally, you should be fluent with API design principles, have experience with full-stack web development and are aware of the friction points of integrating application frameworks in browsers.</p>",
    "content": "<p>Swarm is a system of peer-to-peer networked nodes that create a decentralised storage and communication service. The system is economically self-sustaining due to a built-in incentive system enforced through smart contracts on the Ethereum blockchain.</p><p>Swarm aspires to shape the future towards a self-sovereign global society and permissionless open markets. On Swarm, applications can run autonomously yet securely in a planetary-scale deployment and execution environment.</p><p>For the development of our client-facing APIs (HTTP and CLI), we’re looking for a strong candidate with experience designing and shaping APIs. Ideally, you should be fluent with API design principles, have experience with full-stack web development and are aware of the friction points of integrating application frameworks in browsers. You’ll get extra points if you understand Web3 concepts and how they affect browser security models.</p><p>Please note: this is a pipeline builder announcement, preparing for the upcoming demand. Feel free to submit your application so we can get back to you as soon as the role is open.</p><h2>Your role</h2><ul><li>Development and maintenance of Swarm’s client-facing APIs</li><li>Taking an active role in shaping our APIs</li><li>Coordinating API design with other stakeholders within and outside the organisation</li><li>Bringing code up to spec</li><li>Delivering well-tested code</li><li>Conducting thorough code reviews to your peers</li></ul><h2>Your profile</h2><ul><li>You are familiar with Typescript</li><li>You like to work remotely</li><li>You are available around the CET timezone</li><li>You manage your own time effectively and respect time constraints</li><li>You like to take the initiative</li><li>You don’t need to google SOLID principles</li><li>You can express yourself fluently in English, both verbally and in writing</li></ul><h2>We appreciate</h2><ul><li>A passionate open-source contributor</li><li>Experience with libp2p</li><li>Experience with Go language</li><li>Familiarity with Web3 concepts and ecosystem</li><li>Good grasp of distributed systems</li><li>Acquaintance with cryptographic concepts</li></ul><h2>Swarm offers/Team perks:</h2><ul><li>An open, flat and transparent work environment</li><li>100% remote friendly</li><li>Flexible working hours</li><li>We care about our swarm: Incentives through BZZ, Swarm’s token</li></ul><br /><p>Should you be interested in the position, please send your CV to <a href=\"mailto:talent@ethswarm.org\" target=\"_blank\">talent@ethswarm.org</a>.</p>"
  }
}
