{"pageProps":{"meta":{"title":"Software Developer (Go, Kubernetes, Grafana) - Jobs"},"job":{"category":"Research","title":"Software Developer (Go, Kubernetes, Grafana)","slug":"software-developer-swarm-research-team","description":"<p>The Swarm Foundation Research Team is looking for someone to help increase the understanding of Swarm and improve communication of what Swarm is. The ideal candidate would be an all-round technical profile to help the research team.</p>","content":"<p>Swarm is a system of peer-to-peer networked nodes for a decentralised storage and communication service. </p><p>Swarm could shape the future towards a self-sovereign global society and permissionless open markets. On Swarm, applications run autonomously yet securely in a planetary-scale deployment and execution environment.</p><p>The Swarm Research Team is tasked with rigorously spelling out and analysing Swarm’s underlying theory as well as the current implementation. We create theories, write code, run experiments and make concrete suggestions to Swarm’s engineering teams for further improvements. Our work is consumed by various Swarm teams, as well as the wider (research) community.</p><p>We are looking for a profile that can help increase the understanding of Swarm and improve communication of what Swarm is by clearly articulating all of our assumptions and choices and making models to communicate, refine and challenge these.We are looking for an all-round technical profile to help the research team with various tasks such as:<ul><li>Scraping metrics and data from the real Swarm network</li><li>Implementing custom metrics in the Bee source code</li><li>Creating modified Bee nodes</li><li>Creating Swarm clusters and running test scenarios on them to validate theories</li><li>Analysing and presenting any data gathered</li><li>Extensive mentoring will be provided. From this position, you will be able to grow your career in several directions.</li></ul>Key technologies are: Golang, Kubernetes, Grafana</p><h2>Your role</h2><ul><li>To have a very thorough understanding of how Swarm behaves, while simultaneously elevating everybody else’s understanding</li><li>To help the research team’s ideation process by running custom experiments with the Bee node in Swarm clusters</li><li>To increase the quality of the research team’s proposals by backing them up with data</li><li>To shorten the idea-validation cycle by creating proof-of-concepts</li></ul><h2>Your profile</h2><ul><li>You are a self-starter</li><li>You like to help others</li><li>You have a technical background</li><li>You are curious</li><li>You like to work remotely</li><li>You can express yourself fluently in English, both verbally and in writing</li></li></ul><h2>We appreciate</h2><ul><li>Experience with technologies, or a willingness to learn:</li><ul><li>Golang, Kubernetes, Grafana, Jaeger, OpenTracing, Typescript</li></ul><li>Good grasp of distributed systems</li><li>Acquaintance with cryptographic concepts</li></ul><h2>Swarm offers/Team perks:</h2><ul><li>An open, flat and transparent work environment</li><li>100% remote friendly</li><li>Flexible working hours</li><li>We care about our swarm: Incentives through BZZ, Swarm’s token</li></ul><p>Should you be interested in the position, please send your CV to <a href=\"mailto:talent@ethswarm.org\" target=\"_blank\">talent@ethswarm.org</a>.</p> "}},"__N_SSG":true}