{
  "content": "<p>This Privacy Policy sets out how we, Swarm, obtain, store and use your personal information. The effective date of this Privacy Policy is 10th May 2021.</p><p>By using our Swarm website, under the domains ethswarm.org, you agree to the use and treatment of your personal information in accordance with this Privacy Policy.</p><p>Please read this Privacy Policy carefully. We recommend that you print a copy of this Privacy Policy and any future versions in force from time to time for your records.</p><h2>What type of personal information we collect or obtain about you?</h2><p>The type of information we collect about you may include information such as:</p><ul><li>your name;</li><li>your email address;</li><li>information about your computer (e.g. your IP address and browser type);</li><li>information about how you use our Swarm website or website (e.g. which pages you have viewed, the time you viewed them and what you clicked on); and</li><li>information about your mobile device (such as your geographical location</li></ul><h2>Newsletter</h2><p>Mautic<br />Mautic (https://www.mautic.org/) is a self-hosted open source marketing automation service which organizes and analyzes the distribution of newsletters.</p><p>We use Mautic to analyze our newsletter campaigns. This allows us to determine if a newsletter message has been opened and which links you click on. In addition, technical information is collected (e.g. time of retrieval, IP address ...). This information is used exclusively for the statistical analysis of our newsletter campaigns. The results of these analyses can be used to better tailor future newsletters to your interests. If you do not want your usage of the newsletter to be analyzed by Mautic, you will have to unsubscribe from the newsletter. For this purpose, we provide a link in every newsletter we send.</p><p>Data processing is based on Art. 6 (1) (a) GDPR. You may revoke your consent at any time by unsubscribing to the newsletter. The data processed before we receive your request may still be legally processed.</p><p>The data provided when registering for the newsletter will be used to distribute the newsletter until you cancel your subscription when said data will be deleted from our servers. Data we have stored for other purposes (e.g. email addresses for the members area) remains unaffected.</p><p>For details, see the Mautic privacy policy at: https://www.mautic.org/privacy-policy/</p><p>Completion of a data processing agreement<br />We host Mautic on servers in Switzerland, so that all the data and analysis remains with us and is not passed on. The servers are provided by Exoscale and their Data Protection Agreement can be viewed at: https://www.exoscale.com/dpa/</p><h2>Analytics</h2><p>Matomo<br />www.ethswarm.org website uses the open source and self-hosted web analysis service Matomo. Matomo uses technologies that make it possible to recognize the user across multiple pages with the aim of analyzing the user patterns (e.g. cookies or device fingerprinting). The information recorded by Matomo about the use of this website will be stored on our server. Prior to archiving, the IP address will first be anonymized.</p><p>Through Matomo, we are able to collect and analyze data on the use of our website by website visitors. This enables us to find out, for instance, when which page views occurred and from which region they came. In addition, we collect various log files (e.g. IP address, referrer, browser and operating system used) and can measure whether our website visitors perform certain actions (e.g. clicks, etc.).</p><p>The use of this analysis tool is based on Art. 6 Sect. 1 lit. f GDPR. The website operator has a legitimate interest in the analysis of user patterns, in order to optimize the operator’s web offerings and advertising. If a corresponding agreement has been requested (e.g. an agreement to the storage of cookies), the processing takes place exclusively on the basis of Art. 6 para. 1 lit. a GDPR; the agreement can be revoked at any time.</p><p>Completion of a data processing agreement<br />We host Matomo on servers in Switzerland, so that all the data and analysis remains with us and is not passed on. The servers are provided by Exoscale and their Data Protection Agreement can be viewed at: https://www.exoscale.com/dpa/</p><h2>Plugins and tools</h2><p>Google Web Fonts<br />For uniform representation of fonts, this page uses web fonts provided by Google. When you open a page, your browser loads the required web fonts into your browser cache to display texts and fonts correctly.</p><p>When you call up a page of our website that contains a social plugin, your browser makes a direct connection with Google servers. Google thus becomes aware that our web page was accessed via your IP address. The use of Google Web fonts is done in the interest of a uniform and attractive presentation of our website. This constitutes a legitimate interest pursuant to Art. 6 (1) (f) GDPR.</p><p>If your browser does not support web fonts, a standard font is used by your computer.</p><p>Further information about handling user data, can be found at https://developers.google.com/fonts/faq and in Google’s privacy policy at https://developers.google.com/fonts/faq.</p><h2>Your right to object to the processing of your personal information for certain purposes</h2><p>You have the following rights in relation to your personal information, which you may exercise in the same way as you may exercise the rights in the preceding section (Your rights in relation to your personal information): to object to us using or processing your personal information where we use or process it in order to carry out a task in the public interest, where we do so in the exercise of official authority or for our legitimate interests, including ‘profiling’ (i.e. predicting your behaviour based on your personal information) based on any of these purposes; and to object to us processing your personal information for direct marketing purposes (including any automated evaluation we make about you or any of your characteristics as a person, to the extent that it is related to such direct marketing).</p><p>You may also exercise your right to object to us using or processing your personal information for direct marketing purposes by:</p><ul><li>clicking the unsubscribe link contained at the bottom of any marketing email we send to you and following the instructions which appear in your browser following your clicking on that link; or</li><li>sending an email to info@ethswarm.org. asking that we stop sending you marketing communications or by including the words “OPT OUT”.</li></ul><p>Whenever you object to direct marketing from us by a different communication method to that of the marketing communications you have received from us, you must provide us with your name and sufficient information to enable us to identify you in relation to the communications you have received (for example, if you have received text messages from us and you wish to unsubscribe by email, we may need you to provide us with your phone number in that email).</p><h2>Changes to our Privacy Policy</h2><p>We may change our Privacy Policy from time to time without providing prior notice to you. If required by law, we will make such changes to our Privacy Policy known to you by posting a notice on the website and/or by us posting an updated version of our Privacy Policy on our website with a new effective date stated at the beginning of it. By continuing to access our website on or after that effective date, you agree to be bound by that new version of our Privacy Policy.</p><p>Where we intend to use your personal information for a new purpose other than the purpose(s) for which we originally collected it, we will provide you with information about that purpose and any other relevant information before we use your personal information for that new purpose and obtain your consent if required.</p><h2>Children’s Privacy</h2><p>We do not knowingly contact or collect personal information from children under the age of 13. The website is not intended to solicit information of any kind from children under the age of 13.</p><p>It is possible that we may receive information pertaining to children under the age of 13 by fraud or deception. If we are notified of this, as soon as we verify the information, we will immediately obtain the appropriate parental consent to use that information or, if we are unable to obtain such parental consent, we will delete the information from our servers. If you would like to notify us of our receipt of information about children under the age of 13, please do so by sending an email to info@ethswarm.org.</p><h2>Questions, concerns or complaints</h2><p>Please contact Swarm by sending an email to info@ethswarm.org.</p>"
}
