{"pageProps":{"meta":{"title":"Technical Writer - Jobs"},"job":{"category":"Comms","title":"Technical Writer","slug":"technical-writer","description":"<p>The Swarm Foundation Comms Team is looking for someone to help us set up and maintain effective developer- and user-facing documentation for various software products related to decentralised storage.</p>","content":"<p>Swarm is a system of peer-to-peer networked nodes for a decentralised storage and communication service.</p><p>Swarm could shape the future towards a self-sovereign global society and permissionless open markets. On Swarm, applications run autonomously yet securely in a planetary-scale deployment and execution environment. </p> <p>For the Swarm Technical writer, we’re looking for a strong candidate with the ability to grasp technically complex topics and distil the relevant information in clear, written form.</p><p>We are looking for someone to help set up and maintain effective developer- and user-facing documentation for various software products related to decentralised storage.</p><h2>Your role</h2><ul><li>You are responsible for updating and maintaining the <a href=\"https://docs.ethswarm.org/docs/\" target=\"_blank\">Swarm Documentation</a>. </li><li>You engage with internal teams to obtain an in-depth understanding of the product and the documentation requirements</li><li>You engage with software developers and users of the documentation and incorporate feedback into the documentation.</li><li>Producing various forms of documentation, such as: API documentation, manuals, reference documentation, tutorials, blog posts and walkthroughs.</li></ul><h2>Your profile</h2><ul><li>Experience in setting up and maintaining effective documentation</li><li>Ability to grasp technically complex topics and distil the relevant information in clear, written form</li> <li>Native English or proficient level of English</li> <li>You are available in the CET timezone</li><li>You can and like to work remotely</li><li>You manage your own time effectively and respect time constraints</li><li>You are a self-starter</li> <li>You are a team player</li> <li>You have attention to details</li> </ul><h2>We appreciate</h2><ul><li>Experience with Docusaurus</li><li>A passion for distributed systems</li></ul><h2>Swarm offers/Team perks:</h2><ul><li>An open, flat and transparent work environment</li> <li>100% remote-friendly</li> <li>Flexible working hours</li> <li>We care about our swarm: Incentives through BZZ, Swarm’s token</li></ul><br /><p>Should you be interested in the position, please send your CV to <a href=\"mailto:talent@ethswarm.org\"target=\"_blank\">talent@ethswarm.org</a>.</p>"}},"__N_SSG":true}